{
    "basic_info": {
      "description_header": "Welcome",
      "description": "Hi! I'm Krishan, a Computer Science student at the University of Waterloo with professional experience working with ReactJS/Javascript and Spring Boot/Java. I possess strong communication and interpersonal skills along with technical knowledge in Javascript, C++, Java and Python. I am interested in understanding the inner workings of software and hope to work as a Software Engineer building impactful large-scale software applications.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "GameCenter",
        "description": "GameCenter is a new tab override chrome extension. It replaces Chrome's default new tab page with a responsive, customizable page that displays live statistics (scores, odds, player stat-lines). The live statistics update while the page is active and in the background, even when a chrome window isn't open. The extension also allows users to customize the page background, bookmarks and which sports leagues they wish to follow. The motivation behind this project was to create an extension that allowed me to keep track of sports scores for the NBA and NHL playoff bubbles during the pandemic. At that time, there were a lot of games going on simultaneously and I found it inconvenient having to check each game's score individually, so I created a solution. The extension has evolved to supporting 7 different sports leagues including, the NFL, NBA, NHL, MLB and College Basketball/Football and English Premier League.",
        "images": [
          { "type": "img", 
            "src" : "/images/portfolio/GameCenter/p1.png"
          },
          { "type": "img", 
            "src" : "/images/portfolio/GameCenter/p2.png"
          },
          { "type": "vid", 
            "src" : "/images/portfolio/GameCenter/v1.mov"
          },
          { "type": "vid", 
            "src" : "/images/portfolio/GameCenter/v2.mov"
          },
          { "type": "vid", 
            "src" : "/images/portfolio/GameCenter/v3.mov"
          }
        ],
        "url": "https://chrome.google.com/webstore/detail/gamecenter/bogoecddicljbomiglggipdkigoliekd",
        "sourceCode": "https://github.com/Krishan-Patel/GameCenter-ChromeExtension",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          },
          {
            "class": "devicon-chrome-plain",
            "name": "Extensions API"
          }
        ]
      },
      {
        "title": "LiveView",
        "description": "LiveView is a web-based Peer-to-Peer video chat application that allows users to broadcast video and audio streams to other users in the chat via a P2P connection. Beyond audio and video, the room host can live-stream their computer's display to all other users in the call. The use of Peer-to-Peer connections provides low latency allowing users to enjoy synchronized video playback, an integrated text chat box and audio/video streams creating the optimal watching experience.", 
        "images": [
          { "type": "img", 
            "src" : "/images/portfolio/LiveView/p1.png"
          },
          { "type": "img", 
            "src" : "/images/portfolio/LiveView/p2.png"
          },
          { "type": "img", 
            "src" : "/images/portfolio/LiveView/p3.png"
          },
          { "type": "vid", 
            "src" : "/images/portfolio/LiveView/vid1.mov"
          }
        ],
        "url": "https://peerliveview.herokuapp.com/",
        "sourceCode": "https://github.com/Krishan-Patel/LiveView",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-express-original",
            "name": "Express"
          },
          {
            "class": "devicon-nodejs-plain",
            "name": "Node"
          },
          {
            "class": "devicon-bootstrap-plain",
            "name": "Boostrap"
          },
          {
            "class": "devicon-heroku-plain",
            "name": "Heroku"
          }
        ]
      },
      {
        "title": "StockNow",
        "description": "StockNow is a full-stack stocks website that displays up-to-date stock prices and trends for 500+ stocks from the NYSE. Stock prices are obtained from a RapidAPI endpoint, stored in a PostgreSQL database and updated every 5 minutes. The app's frontend then fetches the stock data from the database speeding up the user experience by a factor of 10X as repeated calls to the slow API endpoint are avoided. StockNow lets users search stocks by name and favourite stocks to view them on their homepage for easy and quick access.", 
        "images": [
          { 
            "type": "img", 
            "src" : "/images/portfolio/StockNow/p1.png"
          }, 
          { 
            "type": "img", 
            "src" : "/images/portfolio/StockNow/p2.png"
          },
          { 
            "type": "img", 
            "src" : "/images/portfolio/StockNow/p3.png"
          },
          { 
            "type": "img", 
            "src" : "/images/portfolio/StockNow/p4.png"
          }
        ],
        "url": "https://frozen-waters-61791.herokuapp.com/stocks/all/",
        "sourceCode":  "https://github.com/Krishan-Patel/StockNow",
        "technologies": [
          {
            "class": "devicon-django-plain",
            "name": "Django"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          },
          {
            "class": "devicon-bootstrap-plain",
            "name": "Bootstrap"
          },
          {
            "class": "devicon-postgresql-plain",
            "name": "PostgreSQL"
          },
          {
            "class": "devicon-heroku-plain",
            "name": "Heroku"
          }
          
        ]
      },
      {
        "title": "Seam Carver",
        "description": "Seam Carver is an image processing algorithm written in Java. It implements a content-aware image resizing function that enables image resizing while maintaining the aspect ratio and image contents unlike traditional resizing methods like cropping. The algorithm uses a dual-gradient energy function and a linear-time shortest path algorithm based on a topological sort to identify the lowest energy 'seam' in the image and remove the seam. I optimized the algorithm using memoization to decrease the number of repeated calculations. This is done by only recalculating pixel energies along the removed seam. This optimization reduced the running time by a factor of 10x for 500px by 500px images.", 
        "images": [
          { 
            "type": "img", 
            "src" : "/images/portfolio/SeamCarver/p1.png"
          },
          { 
            "type": "img", 
            "src" : "/images/portfolio/SeamCarver/p2.png"
          },
          { 
            "type": "img", 
            "src" : "/images/portfolio/SeamCarver/p3.jpeg"
          },
          { 
            "type": "img", 
            "src" : "/images/portfolio/SeamCarver/p4.png"
          },
          { 
            "type": "img", 
            "src" : "/images/portfolio/SeamCarver/p5.jpeg"
          },
          { 
            "type": "img", 
            "src" : "/images/portfolio/SeamCarver/p6.png"
          },
          { 
            "type": "img", 
            "src" : "/images/portfolio/SeamCarver/p7.jpeg"
          },
          { 
            "type": "img", 
            "src" : "/images/portfolio/SeamCarver/p8.png"
          }
        ],
        "url": "",
        "sourceCode": "https://github.com/Krishan-Patel/SeamCarver",
        "technologies": [
          {
            "class": "devicon-java-plain",
            "name": "Java"
          }
        ]
      }, 
      {
        "title": "Biquadris",
        "description": "I developed Biquadris with two other individuals for our summative project in an Object-Oriented Programming course. Our implementation of Biquadris included both text-based and graphical versions of the game. The game featured 9 rotating blocks, 6 levels, customized level-based scoring, row clearing and Tetris gravity. As part of our implementation, we made use of various OOP concepts including; inheritance, polymorphism, encapsulation as well as the Decorator and MCV design patterns.", 
        "images": [
          { 
            "type": "img", 
            "src" : "/images/portfolio/Biquadris/p1.png"
          }, 
          { 
            "type": "img", 
            "src" : "/images/portfolio/Biquadris/p2.png"
          }
        ],
        "url": "",
        "sourceCode": "",
        "technologies": [
          {
            "class": "devicon-cplusplus-plain",
            "name": "C++"
          }
        ]
      },
      {
        "title": "Task Manager",
        "description": "The motivation behind Task Manager was to create a task-managing application that solved the issues I had with other applications. Some of the issues included; improving accessibility by making the application accessible from inside the browser, syncing tasks between devices, showing completed tasks and daily progress. To solve these issues, I created a chrome extension that is integrated into the browser allowing for easy access. Task Manager tracks the completed and incomplete tasks and clears completed tasks daily.", 
        "images": [
          { 
            "type": "img", 
            "src" : "/images/portfolio/TaskManager/p1.png"
          }, 
          { 
            "type": "img", 
            "src" : "/images/portfolio/TaskManager/p2.png"
          }, 
          { 
            "type": "img", 
            "src" : "/images/portfolio/TaskManager/p3.png"
          }
        ],
        "url": "",
        "sourceCode": "https://github.com/Krishan-Patel/TaskManager-Browser-Extension",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          },
          {
            "class": "devicon-html5-plain",
            "name": "HTML"
          },
          {
            "class": "devicon-css3-plain",
            "name": "CSS"
          },
          {
            "class": "devicon-chrome-plain",
            "name": "Extensions API"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Auvik Networks",
        "icon": "fab fa-js experience-icon",
        "title": "Backend Developer",
        "years": "Sept 2023 - Dec 2023",
        "description": "During Fall 2023, I interned as a Backend Developer at Auvik Networks working on ASM, the company's  SAAS management product. I leveraged React, Node and Express to develop the product's backend infrastructure by making Postgres DB changes, maintaining REST APIs and fixing user-reported issues. A key achievement during my term was leading development efforts to enhance DB query speeds. This involved introducing an aggregate database table and creating a dedicated processor to maintain the table efficiently, utilizing AWS SQS. The implementation resulted in up to 10X faster performance across various components of the application. In addition to technical contributions, I assumed Epic Ownership responsibilities, collaborating with stakeholders to plan, develop, and deliver a feature that was crucial in preventing churn and ultimately boosting customer satisfaction. Finally, I leveraged the JEST framework to author automated tests, achieving  100% code coverage for all my contributions.",
        "mainTech": [
          "Node",
          "React", 
          "PostgreSQL"
        ], 
        "technologies": [
          "ReactJS",
          "NodeJS", 
          "Express", 
          "PostgreSQL", 
          "JEST", 
          "AWS",
          "SQL"
        ]
      },
      {
        "company": "Ford Motor Company",
        "icon": "fab fa-java experience-icon",
        "title": "Cloud Software Developer",
        "years": "Jan 2023 - Apr 2023",
        "description": "During Winter 2023, I worked as a Cloud Software Developer at Ford on their Analytics Server team. The team was responsible for developing and maintaining analytic tools to report and track vehicle issues from both consumer and internal testing vehicles. The team worked closely with the Embedded, Data Science and UAT teams. During my time a Ford, I implemented a Speech Processor that transcribes and translated audio feedback from customers from various languages using the Google Cloud Speech and Translation APIs. I helped implement various other features requested by the team's internal stakeholders many of which required me to update the application DB schema using DDL and DML SQL scripts and perform ETLs when the changes went live. Finally, as part of my work on the team, I identified redundancies in the team's micro-services and proposed a fix which resulted in a 25% improvement in processing performance.",
        "mainTech": [
          "Java",
          "Spring Boot", 
          "SQL Server"
        ], 
        "technologies": [
          "Java", 
          "Spring Boot", 
          "SQL Server", 
          "RabbitMQ", 
          "Jira Cloud API",
          "Google Cloud Platform"
        ]
      },
      {
        "company": "SS&C Technologies",
        "icon": "fab fa-java experience-icon",
        "title": "Full Stack Developer",
        "years": "May 2022 - Aug 2022",
        "description": "During Spring 2022, I worked at SS&C Technologies as a Full Stack Developer. The team I was a part of was working on SS&C Lyric, an initiative designed to modernize the company's recordkeeping platform by transitioning to a cloud-native architecture. As part of my work with the team, I implemented column-level encryption in Java using encryption as a service provided by HashiCorp Vault. I developed a Vault Utility, extending the functionality provided by the Spring Cloud Vault Library to address a lack of support for the team's needs. I used Kafka, Vault and the Java Reflections API to develop a key-rewrapping utility compatible with all of the company's microservices. I worked with the DevOps team to set up GitHub Workflows that automate the deployment of microservices to Kubernetes. I created a Github Action in Node.JS that automates repository creation and setup for new microservices based on SDLC requirements outlined by the DevOps team.",
        "mainTech": [
          "Java",
          "Spring Boot", 
          "PostgreSQL"
        ], 
        "technologies": [
          "Java", 
          "Spring Boot", 
          "PostgreSQL", 
          "Apache Kafka", 
          "HashiCorp Vault", 
          "Kubernetes",
          "Docker", 
          "GitHub API"
        ]
      },
      {
        "company": "University of Waterloo - Cynorix Inc.",
        "icon": "fab fa-js experience-icon",
        "title": "Full Stack Developer",
        "years": "Sept 2021 - Dec 2021",
        "description": "During Fall 2021, I worked as a Software Developer at Cynorix Inc. During my time at the company, I worked on their Secure Video Conferencing and Secure File Sharing products. I published and maintained the iOS apps for both applications using React-Native. I implemented hands-free multi-factor authentication on iOS for the video-conferencing application. I used Node, React, MongoDB and Express to implement various features including, processing user transactions, user referrals, account changes and meeting creation. I used Electron and C++ when working on the desktop application for the file-sharing product to help develop file encryption, file compression and file sharing features.",
        "mainTech": [
          "React",
          "Express", 
          "MongoDB"
        ],
        "technologies": [
          "ReactJS",
          "React-Native",
          "NodeJS", 
          "Express", 
          "Bootstrap", 
          "HTML/CSS", 
          "MongoDB", 
          "Electron", 
          "C++" 
        ]
      },
      {
        "company": "Digitize Tech",
        "icon": "fab fa-python experience-icon",
        "title": "Program Mentor",
        "years": "July 2020 - August 2020",
        "description":"As a program mentor for Digitize Tech, I held one on one tutorial sessions with underprivileged kids to help introduce them to the fundamentals of computer science with python. I was responsible for structuring the lesson plans based on the individual's experience and organizing learning material",
        "mainTech": [
          "Python"
        ],
        "technologies": [
        ]
      }
    ]
  }